#include<iostream>

using namespace std;

int main() {
	// инкремент  ++ - прибавить единицу
	int numb = 5;
	
	//// пре инкремент - сначала прибавляет единицу потом показывает (использует) значение.
	//cout << ++numb << endl;
	//// пост инкремент - сначала показывает (использует) значение потом прибавляет единицу .
	//cout << numb++ << endl;
	//cout << numb << endl;

	//// декремент --
	//// пре декремент
	//cout << --numb << endl; // 6
	//// пост декремент
	//cout << numb-- << endl; // 6
	//cout << numb << endl; // 5
	
}